tutorials/pimpleHFDIBFoam/Immersed_Cyl_Oscillating/ImmersedCyl-Sinusoidal-Re39-Mesh14080/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  OF2512 blockMeshDict: channel with filled centre (no hole)                 |
|  Graded coarse-to-fine-to-coarse mesh in x                                  |
|  4x coarser in nx and 4x coarser in ny than 225280-cell mesh                |
|  Total cells = 14080, nz = 1                                                |
|  Cylinder centre: (1.1 0.2 0.05), radius 0.05, amplitude ~0.25              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    // z = 0 plane
    (0      0        0)   //  0
    (0      0.16464466094067265 0) //  1
    (0      0.23535533905932737 0) //  2
    (0      0.41     0)   //  3

    (0.78   0        0)   //  4
    (0.78   0.16464466094067265 0) //  5
    (0.78   0.23535533905932737 0) //  6
    (0.78   0.41     0)   //  7

    (1.42   0        0)   //  8
    (1.42   0.16464466094067265 0) //  9
    (1.42   0.23535533905932737 0) // 10
    (1.42   0.41     0)   // 11

    (2.2    0        0)   // 12
    (2.2    0.16464466094067265 0) // 13
    (2.2    0.23535533905932737 0) // 14
    (2.2    0.41     0)   // 15

    // z = 0.1 plane
    (0      0        0.1) // 16
    (0      0.16464466094067265 0.1) // 17
    (0      0.23535533905932737 0.1) // 18
    (0      0.41     0.1) // 19

    (0.78   0        0.1) // 20
    (0.78   0.16464466094067265 0.1) // 21
    (0.78   0.23535533905932737 0.1) // 22
    (0.78   0.41     0.1) // 23

    (1.42   0        0.1) // 24
    (1.42   0.16464466094067265 0.1) // 25
    (1.42   0.23535533905932737 0.1) // 26
    (1.42   0.41     0.1) // 27

    (2.2    0        0.1) // 28
    (2.2    0.16464466094067265 0.1) // 29
    (2.2    0.23535533905932737 0.1) // 30
    (2.2    0.41     0.1) // 31
);

blocks
(
    // Left zone: coarse at x=0, finer toward x=0.78
    hex (0 4 5 1 16 20 21 17)    (44 16 1) simpleGrading (0.25 1 1)
    hex (1 5 6 2 17 21 22 18)    (44 8 1)  simpleGrading (0.25 1 1)
    hex (2 6 7 3 18 22 23 19)    (44 16 1) simpleGrading (0.25 1 1)

    // Middle zone: uniformly fine
    hex (4 8 9 5 20 24 25 21)    (264 16 1) simpleGrading (1 1 1)
    hex (5 9 10 6 21 25 26 22)   (264 8 1)  simpleGrading (1 1 1)
    hex (6 10 11 7 22 26 27 23)  (264 16 1) simpleGrading (1 1 1)

    // Right zone: fine at x=1.42, coarser toward x=2.2
    hex (8 12 13 9 24 28 29 25)    (44 16 1) simpleGrading (4 1 1)
    hex (9 13 14 10 25 29 30 26)   (44 8 1)  simpleGrading (4 1 1)
    hex (10 14 15 11 26 30 31 27)  (44 16 1) simpleGrading (4 1 1)
);

edges
(
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
        );
    }

    right
    {
        type patch;
        faces
        (
            (12 28 29 13)
            (13 29 30 14)
            (14 30 31 15)
        );
    }

    up
    {
        type wall;
        faces
        (
            (3 7 23 19)
            (7 11 27 23)
            (11 15 31 27)
        );
    }

    down
    {
        type wall;
        faces
        (
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
        );
    }
);

mergePatchPairs();
